Wikhh/STM32_K230_-/stm32_3/USER/AllHeader.h
#ifndef __AllHeader_H
#define __AllHeader_H


#define DEBUG_USARTx USART1  //打印信息串口

#define bool _Bool
#define true 1
#define false 0

#include <stdio.h>
#include "string.h"
#include "stm32f10x.h"
#include "bsp.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_bkp.h"
#include "bsp_gpio.h"
#include "bsp_servo.h"
#include "bsp_ps2.h"
#include "delay.h"
#include "bsp_timer.h"
#include "bsp_beep.h"
#include "bsp_adc.h"
#include "bsp_juice_adc.h"
#include "bsp_usart.h"
#include "bsp_common.h"
#include "oled_iic.h"
#include "oled_fonts.h"
#include "bsp_oled.h"
#include "bsp_key.h"
#include "usart.h"


#define GROUP_NUM 1 //24路舵机很3组，一组8个
#define DUOJI_NUM 2  //定义每组的舵机数
extern u8 grop ;//按键的组别数，主要应用在手柄
extern float version;//版本号


/*定义需要初始化的舵机宏定义开关*/
//1-8（第一组）
#define USE_SERVO_J1
#define USE_SERVO_J2
// #define USE_SERVO_J3
// #define USE_SERVO_J4
#define USE_SERVO_J5
#define USE_SERVO_J6
// #define USE_SERVO_J7
// #define USE_SERVO_J8


/*ps2 手柄的定义开关 1：打开 0：关闭*/
#define PS_TWO 0

/*蜂鸣器的定义开关 1：打开 0：关闭*/
#define BEEP_SW 1

/*电压电流检测定义开关 1：打开 0：关闭*/
#define Battery_SW 1

/*oled的定义开关 1：打开 0：关闭*/
#define OLED_SW 1




//定时器输出pwm，实现角度控制
extern int Angle_J[GROUP_NUM][DUOJI_NUM];

void void_jutce(void);

void dectect_beep(void);
void test_ps2(void);
void user_douji(void);
void deal_bluetooth(u8 Rx_temp);
u8 deal_data(void);
#endif


